kb1c/src/InformationRegisters/НастройкиБазыЗнаний/НастройкиБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиБазыЗнаний</name>
  <resources>
    <name>ЗначениеСсылка</name>
    <type>
      <types>AnyRef</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеЧисло</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеСтрока</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеБулево</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ИмяРесурса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИмяНастройки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

kb1c/src/InformationRegisters/НастройкиБазыЗнаний/ManagerModule.bsl
Функция ПолучитьЗначениеНастройки(знач ИмяНастройки, знач ПользовательСсылка) Экспорт
	
	Если НЕ ТипЗнч(ПользовательСсылка) = Тип("СправочникСсылка.Пользователи") Тогда
		ПользовательСсылка = Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИмяНастройки"	, ИмяНастройки);
	Запрос.УстановитьПараметр("Пользователь"	, ПользовательСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиБазыЗнаний.ИмяНастройки,
	|	НастройкиБазыЗнаний.Пользователь,
	|	НастройкиБазыЗнаний.ЗначениеСсылка,
	|	НастройкиБазыЗнаний.ЗначениеЧисло,
	|	НастройкиБазыЗнаний.ЗначениеСтрока,
	|	НастройкиБазыЗнаний.ЗначениеБулево,
	|	НастройкиБазыЗнаний.ИмяРесурса
	|ИЗ
	|	РегистрСведений.НастройкиБазыЗнаний КАК НастройкиБазыЗнаний
	|ГДЕ
	|	НастройкиБазыЗнаний.ИмяНастройки = &ИмяНастройки
	|	И НастройкиБазыЗнаний.Пользователь = &Пользователь";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка[Выборка.ИмяРесурса];
	
КонецФункции
